{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-ACTION",
    "1": "B-LICENSE_PLATE",
    "2": "B-LOCATION",
    "3": "B-PERMIT_STATUS",
    "4": "B-REPEAT_STATUS",
    "5": "B-TIME_PERIOD",
    "6": "B-VEHICLE_BRAND",
    "7": "B-VEHICLE_COLOR",
    "8": "B-VEHICLE_TYPE",
    "9": "B-VIOLATION_OBJECT",
    "10": "B-WEATHER",
    "11": "B-ZONE_TYPE",
    "12": "I-LOCATION",
    "13": "I-PERMIT_STATUS",
    "14": "I-REPEAT_STATUS",
    "15": "I-TIME_PERIOD",
    "16": "I-VEHICLE_COLOR",
    "17": "I-VEHICLE_TYPE",
    "18": "I-VIOLATION_OBJECT",
    "19": "I-ZONE_TYPE",
    "20": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ACTION": 0,
    "B-LICENSE_PLATE": 1,
    "B-LOCATION": 2,
    "B-PERMIT_STATUS": 3,
    "B-REPEAT_STATUS": 4,
    "B-TIME_PERIOD": 5,
    "B-VEHICLE_BRAND": 6,
    "B-VEHICLE_COLOR": 7,
    "B-VEHICLE_TYPE": 8,
    "B-VIOLATION_OBJECT": 9,
    "B-WEATHER": 10,
    "B-ZONE_TYPE": 11,
    "I-LOCATION": 12,
    "I-PERMIT_STATUS": 13,
    "I-REPEAT_STATUS": 14,
    "I-TIME_PERIOD": 15,
    "I-VEHICLE_COLOR": 16,
    "I-VEHICLE_TYPE": 17,
    "I-VIOLATION_OBJECT": 18,
    "I-ZONE_TYPE": 19,
    "O": 20
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "vocab_size": 30522
}
