{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Absolute No Parking",
    "1": "Access Road Blocking",
    "2": "Accident Prone Area",
    "3": "Blind Spot Parking",
    "4": "Bus Stop Violation",
    "5": "Disabled Parking Violation",
    "6": "Double Parking",
    "7": "Driveway Blocking",
    "8": "Emergency Exit Blocking",
    "9": "Escalating Violations",
    "10": "Event-Based Restriction",
    "11": "Expired Meter",
    "12": "Expired Permit",
    "13": "Fire Hydrant Blocking",
    "14": "Forged Permit",
    "15": "Green Zone Violation",
    "16": "Habitual Offender",
    "17": "Heritage Zone Violation",
    "18": "Hospital Zone Violation",
    "19": "Idling Violation",
    "20": "Ignored Citations",
    "21": "Intersection Blocking",
    "22": "Lane Obstruction",
    "23": "Loading Zone Violation",
    "24": "Meter Tampering",
    "25": "Narrow Road Parking",
    "26": "Near Crossing",
    "27": "No Payment",
    "28": "No Permit",
    "29": "Park Area Violation",
    "30": "Pedestrian Path Obstruction",
    "31": "Railway Crossing",
    "32": "Same Location Repeat",
    "33": "School Zone Violation",
    "34": "Street Cleaning Violation",
    "35": "Time-Restricted Parking",
    "36": "Turning Point Violation",
    "37": "VIP Area Violation",
    "38": "Visitor Violation",
    "39": "Water Body Proximity",
    "40": "Wrong Payment Method",
    "41": "Wrong Side Parking",
    "42": "Wrong Zone Permit"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Absolute No Parking": 0,
    "Access Road Blocking": 1,
    "Accident Prone Area": 2,
    "Blind Spot Parking": 3,
    "Bus Stop Violation": 4,
    "Disabled Parking Violation": 5,
    "Double Parking": 6,
    "Driveway Blocking": 7,
    "Emergency Exit Blocking": 8,
    "Escalating Violations": 9,
    "Event-Based Restriction": 10,
    "Expired Meter": 11,
    "Expired Permit": 12,
    "Fire Hydrant Blocking": 13,
    "Forged Permit": 14,
    "Green Zone Violation": 15,
    "Habitual Offender": 16,
    "Heritage Zone Violation": 17,
    "Hospital Zone Violation": 18,
    "Idling Violation": 19,
    "Ignored Citations": 20,
    "Intersection Blocking": 21,
    "Lane Obstruction": 22,
    "Loading Zone Violation": 23,
    "Meter Tampering": 24,
    "Narrow Road Parking": 25,
    "Near Crossing": 26,
    "No Payment": 27,
    "No Permit": 28,
    "Park Area Violation": 29,
    "Pedestrian Path Obstruction": 30,
    "Railway Crossing": 31,
    "Same Location Repeat": 32,
    "School Zone Violation": 33,
    "Street Cleaning Violation": 34,
    "Time-Restricted Parking": 35,
    "Turning Point Violation": 36,
    "VIP Area Violation": 37,
    "Visitor Violation": 38,
    "Water Body Proximity": 39,
    "Wrong Payment Method": 40,
    "Wrong Side Parking": 41,
    "Wrong Zone Permit": 42
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "vocab_size": 30522
}
